[Killed] BlockStatement
Documents/Bachelor Degree/mutationtest/fizzbuzz.js:1:23
-function fizzbuzz(num){
-	if(0 < num && num < 101) 
-	  return (((num%3)?'':'Fizz')+((num%5)?'':'Buzz')||num.toString())
-	return ('invalid input')
-  }
+function fizzbuzz(num){}
   
   module.exports = fizzbuzz
killedBy: Se o número for divisível por 3: "Fizz"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fizz"
Received: undefined

[Killed] ConditionalExpression
Documents/Bachelor Degree/mutationtest/fizzbuzz.js:2:5
 function fizzbuzz(num){
-	if(0 < num && num < 101) 
+	if(true) 
 	  return (((num%3)?'':'Fizz')+((num%5)?'':'Buzz')||num.toString())
 	return ('invalid input')
killedBy: aceite valores de 1 a 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "invalid input"
Received: "FizzBuzz"

[Killed] ConditionalExpression
Documents/Bachelor Degree/mutationtest/fizzbuzz.js:2:5
 function fizzbuzz(num){
-	if(0 < num && num < 101) 
+	if(true && num < 101) 
 	  return (((num%3)?'':'Fizz')+((num%5)?'':'Buzz')||num.toString())
 	return ('invalid input')
killedBy: aceite valores de 1 a 100
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "invalid input"
Received: "FizzBuzz"

[Killed] ArithmeticOperator
Documents/Bachelor Degree/mutationtest/fizzbuzz.js:3:14
 function fizzbuzz(num){
 	if(0 < num && num < 101) 
-	  return (((num%3)?'':'Fizz')+((num%5)?'':'Buzz')||num.toString())
+	  return (((num * 3)?'':'Fizz')+((num%5)?'':'Buzz')||num.toString())
 	return ('invalid input')
   }
killedBy: Se o número for divisível por 3: "Fizz"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Fizz"
Received: "3"

[Killed] ArithmeticOperator
Documents/Bachelor Degree/mutationtest/fizzbuzz.js:3:34
 function fizzbuzz(num){
 	if(0 < num && num < 101) 
-	  return (((num%3)?'':'Fizz')+((num%5)?'':'Buzz')||num.toString())
+	  return (((num%3)?'':'Fizz')+((num * 5)?'':'Buzz')||num.toString())
 	return ('invalid input')
   }
killedBy: Se o número for divisível por 5: "Buzz"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Buzz"
Received: "5"
